questions = [
    "Как вы оцениваете понятность материала, изложенного на данной лекции?",
    "Считаете ли вы, что объяснения преподавателя были достаточно четкими и полными?",
    "Были ли примеры, приведенные преподавателем, понятны и иллюстративны?",
    "Как вы оцениваете методы обучения, используемые на данной лекции?",
    "Считаете ли вы, что преподаватель активно взаимодействовал с аудиторией и отвечал на вопросы студентов?",
    "Есть ли какие-то аспекты лекции, которые были не совсем понятны или вызвали затруднения?",
    "Что, по вашему мнению, преподаватель мог бы сделать по-другому, чтобы сделать лекцию более понятной и интересной?",
    "Какие аспекты лекции вас больше всего заинтересовали или впечатлили?",
    "Есть ли какие-то дополнительные вопросы или замечания, которые вы хотели бы передать преподавателю?"
]
